Can't create Boundary as an offset of Run Curve
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotOffsetBoundary { get; }
  Visual Basic
Public Shared ReadOnly Property CannotOffsetBoundary As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotOffsetBoundary {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace